In [2]:
import pandas as pd

Data manipulation in pandas refers to editing and modifying existing dataframes

common opn are:
    adding rows/cols
    removing rows/cols
    renaming rows/cols

In [5]:
#ADD A NEW COLUMN TO A PANDAS DATAFRAME
data = {
    'name':['john', 'emma', 'michael','sophia'],
    'height':[5.5,6.0,5.8,5.3],
    'qualification':['bsc','bba','mba','bsc']
}
df = pd.DataFrame(data)

df

#declare a new list
address = ['New york','london','sydney','toronto']

#assign the list as column
df['address'] = address

df

      name  height qualification   address
0     john     5.5           bsc  New york
1     emma     6.0           bba    london
2  michael     5.8           mba    sydney
3   sophia     5.3           bsc   toronto

In [7]:
#Add a row to a pandas dataframe
df.loc[len(df.index)] = ['nitish',5.7,'SDE','noida']
df

      name  height qualification   address
0     john     5.5           bsc  New york
1     emma     6.0           bba    london
2  michael     5.8           mba    sydney
3   sophia     5.3           bsc   toronto
4   nitish     5.7           SDE     noida

In [9]:
#remove rows/cols from df

#delete row with index 4
df.drop(4, axis=0, inplace=True)#axis=1 is cols and axis=0 is rows.... default is axis=0
#inplace=false is temp delete, and inplace=true is permanent del

#delete rows with index 1 and 3
df.drop([1,3], axis=0,inplace=True)
df

      name  height qualification   address
0     john     5.5           bsc  New york
2  michael     5.8           mba    sydney

In [10]:
#delete cols
#delete age column
df.drop('address',axis=1)

      name  height qualification
0     john     5.5           bsc
2  michael     5.8           mba

In [12]:
#rename columns/labels
df.rename(columns={'name':'First_Name'}, inplace=True)
df

  First_Name  height qualification   address
0       john     5.5           bsc  New york
2    michael     5.8           mba    sydney